run/rockerPlate/rockingPlate_sharp_b/constant/polyMesh/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.7.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices        
(
    (0 0 -.17)
    (0.9 0 -.17)
    (0.9 0.02 -.17)
    (0 0.02 -.17)
    (0 0 0)
    (0.9 0 0)
    (0.9 0.02 0)
    (0 0.02 0)
    (0.3 0 0)
    (0.3 0.02 0)
    (0.6 0 0)
    (0.6 0.02 0)
    (0.3 0 -.17)
    (0.3 0.02 -.17)
    (0.6 0 -.17)
    (0.6 0.02 -.17)

    (0.3 0 -.015)
    (0.3 0.02 -.015)
    (0.6 0 -.015)
    (0.6 0.02 -0.015)
    (0 0 -0.015)
    (0 0.02 -0.015)
    (0.9 0 -0.015)
    (0.9 0.02 -0.015)

    (0.3 0 -.015)
    (0.3 0.02 -.015)
    (0.6 0 -.015)
    (0.6 0.02 -0.015)
    (0.3 0 .015)
    (0.3 0.02 .015)
    (0.6 0 .015)
    (0.6 0.02 0.015)
    
    );

blocks          
(
    hex (0 12 13 3 20 16 17 21) (100 1 50) simpleGrading (1 1 0.25)
    hex (20 16 17 21 4 8 9 7) (100 1 10) simpleGrading (1 1 1)
    hex (12 14 15 13 16 18 19 17) (100 1 50) simpleGrading (1 1 0.25)
    hex (14 1 2 15 18 22 23 19) (100 1 50) simpleGrading (1 1 0.25)
    hex (18 22 23 19 10 5 6 11) (100 1 10) simpleGrading (1 1 1)

    hex (24 26 27 25 28 30 31 29) (100 1 20) simpleGrading (1 1 1)
);

edges           
(
);

boundary
(

    seaBed
    {
          type wall;
          faces
         (
	  (4 8 9 7)
	  (10 5 6 11)	
	  (16 18 19 17)
	  (16 8 9 17)
          (18 10 11 19)	
         ) ;
    }
    

    
    
     frontBack
    {
          type empty;
          faces
         (
	  (3 21 17 13)
	  (21 7 9 17)
	  (13 17 19 15)
	  (15 19 23 2)
	  (19 11 6 23)          
          (0 12 16 20)
          (20 16 8 4)          
          (12 14 18 16)
          (14 1 22 18)
          (18 22 5 10)

      (24 28 30 26)
      (25 29 31 27)

         ) ;
    }  
    
    soilDomainBottom
    {
          type wall;
          faces
         (
	  (0 12 13 3 )
	  (12 14 15 13 )
	  (14 1 2 15 )
	  	
         ) ;
    } 
    
    left
    {
    type wall;
        //  type cyclic;
        //  neighbourPatch  right;
         faces
        (
            (0 20 21 3)
            (20 4 7 21)
        );
          
    }
     
     right
    {
    type wall;
         // type cyclic;
         // neighbourPatch  left;
         faces
        (
            (1 22 23 2)
            (22 5 6 23)
        );
          
    }  

    rockerTop
    {
          type wall;
          faces
         (
             (28 30 31 29)
             //(31 30 26 27)	
             //(24 28 29 25)	
         );
    }
    rocker
    {
          type wall;
          faces
         (
             (24 25 27 26)
             (31 30 26 27)	
             (24 28 29 25)	
         ) ;
    }





);


mergePatchPairs 
(
);

// ************************************************************************* //
